test.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1"
            xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1"
            xmlns:ns3="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/faults/1.1"
            xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Body>
        <ns:SendRequestRequest>
            <ns:SenderProvidedRequestData Id="SIGNED_BY_CONSUMER" wsu:Id="SIGNED_BY_CONSUMER">
                <ns:MessageID>d44dc848-1d8c-11ea-89ae-005056bb982b</ns:MessageID>
                <ns2:MessagePrimaryContent
                        xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
                    <rq:FNSINNSingularRequest xmlns:rq="urn://x-artefacts-fns-inn-singular/root/270-18/4.0.1"
                                              ИдЗапрос="d44dc848-1d8c-11ea-89ae-005056bb982b">
                        <rq:СведЮЛ ОГРН="1037843048880" ИННЮЛ="7825497650" НаимОрг="Нагрузочное тестирование"/>
                        <rq:СведФЛ ДатаРожд="1954-07-12"
                                   МестоРожд="РОССИЯ,,ГОРЬКОВСКАЯ ОБЛ.,АРЗАМАССКИЙ Р-Н,,НИКОЛЬСКОЕ С., ,,,">
                            <com:ФИО xmlns:com="urn://x-artefacts-fns-inn/commons/4.0.0" Имя="ПЕТР" Фамилия="ЧАХЛОВ"
                                     Отчество="АЛЕКСЕЕВИЧ"/>
                            <com:УдЛичнФЛ xmlns:com="urn://x-artefacts-fns-inn/commons/4.0.0" КодВидДок="21"
                                          СерНомДок="22 02 919928" ДатаДок="2002-11-16" ВыдДок="АРОВД"
                                          КодВыдДок="issueCode"/>
                        </rq:СведФЛ>
                    </rq:FNSINNSingularRequest>
                </ns2:MessagePrimaryContent>
                <ns:TestMessage/>
            </ns:SenderProvidedRequestData>
            <ns:CallerInformationSystemSignature>
                <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                    <ds:SignedInfo>
                        <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        <ds:SignatureMethod
                                Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34102012-gostr34112012-256"/>
                        <ds:Reference URI="#SIGNED_BY_CONSUMER">
                            <ds:Transforms>
                                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            </ds:Transforms>
                            <ds:DigestMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gostr34112012-256"/>
                            <ds:DigestValue>V8XNitS3N95nmTQEMSOxEJf61EcjeivqvHkhi5zMteA=</ds:DigestValue>
                        </ds:Reference>
                    </ds:SignedInfo>
                    <ds:SignatureValue>kT/zG3cQenBn/FLJyr9W1O9RRFZDvFtobu9eGt070CpyrRZe3DvHpZKt7J0F/NMC
                        T2778YzdhhtvWn7WcT3X9g==
                    </ds:SignatureValue>
                    <ds:KeyInfo>
                        <ds:X509Data>
                            <ds:X509Certificate>MIIKADCCCa2gAwIBAgIQB2XEmY6c5J3pEYuLSjRjmzAKBggqhQMHAQEDAjCCAYEx
                                HDAaBgkqhkiG9w0BCQEWDWNhQGlhYy5zcGIucnUxGDAWBgUqhQNkARINMTAzNzg0
                                MzA0MjkwNzEaMBgGCCqFAwOBAwEBEgwwMDc4MTUwMDA4NzAxCzAJBgNVBAYTAlJV
                                MSkwJwYDVQQIDCA3OCDQodCw0L3QutGCLdCf0LXRgtC10YDQsdGD0YDQszEmMCQG
                                A1UEBwwd0KHQsNC90LrRgi3Qn9C10YLQtdGA0LHRg9GA0LMxYDBeBgNVBAkMV9Cf
                                0LXRgNC10YPQu9C+0Log0KLRgNCw0L3RgdC/0L7RgNGC0L3Ri9C5LCA2LCDQm9C4
                                0YLQtdGAINCQLCDQv9C+0LzQtdGJ0LXQvdC40Y8gN9CdIDjQnTEZMBcGA1UECwwQ
                                0J7RgtC00LXQuyDihJY0MTEmMCQGA1UECgwd0KHQn9CRINCT0KPQnyAi0KHQn9CR
                                INCY0JDQpiIxJjAkBgNVBAMMHdCh0J/QkSDQk9Cj0J8gItCh0J/QkSDQmNCQ0KYi
                                MB4XDTE5MDYxMDE0MTUzNVoXDTIwMDYxMDE0MTUzNVowggIEMTgwNgYDVQQJDC/R
                                g9C7LiDQn9GA0L7QstC10YDQvtGH0L3QsNGPLCDQtC4gMSwg0LvQuNGCLiDQkDEW
                                MBQGBSqFA2QDEgszNjUyMzkxMzU4NjEYMBYGBSqFA2QBEg05MDk2MzM0ODg3NzI4
                                MRowGAYIKoUDA4EDAQESDDAwMjAwNzg0NzkwNzEdMBsGCSqGSIb3DQEJARYOdGVz
                                dEB0ZXN0LnRlc3QxCzAJBgNVBAYTAlJVMSkwJwYDVQQIDCA3OCDQodCw0L3QutGC
                                LdCf0LXRgtC10YDQsdGD0YDQszEmMCQGA1UEBwwd0KHQsNC90LrRgi3Qn9C10YLQ
                                tdGA0LHRg9GA0LMxMDAuBgNVBAoMJ9Ci0LXRgdGC0L7QstCw0Y8g0L7RgNCz0LDQ
                                vdC40LfQsNGG0LjRjzEsMCoGA1UECwwj0J7RgtC00LXQuyDRgtC10YHRgtC40YDQ
                                vtCy0LDQvdC40Y8xIjAgBgNVBCoMGdCi0LXRgdGCINCi0LXRgdGC0L7QstC40Ycx
                                FTATBgNVBAQMDNCi0LXRgdGC0L7QsjEuMCwGA1UEDAwl0JjQvdC20LXQvdC10YAt
                                0L/RgNC+0LPRgNCw0LzQvNC40YHRgjEwMC4GA1UEAwwn0KLQtdGB0YLQvtCy0LDR
                                jyDQvtGA0LPQsNC90LjQt9Cw0YbQuNGPMGYwHwYIKoUDBwEBAQEwEwYHKoUDAgIk
                                AAYIKoUDBwEBAgIDQwAEQGVf4NYgXHFw45qgtylfNJtTqkPRbcliwIHD6GH+b3X1
                                +jPVOOTzBH12xg7W1i2qqs78c+T3awWXOOXlc6QdcJGjggVxMIIFbTAOBgNVHQ8B
                                Af8EBAMCBPAwHQYDVR0OBBYEFNhARAWmqJjDjrkKC/d0tKhNMNeVMIIBXwYDVR0j
                                BIIBVjCCAVKAFI0s8ZDHLKn4Q1WqxkCy+a5T/6cLoYIBLKSCASgwggEkMR4wHAYJ
                                KoZIhvcNAQkBFg9kaXRAbWluc3Z5YXoucnUxCzAJBgNVBAYTAlJVMRgwFgYDVQQI
                                DA83NyDQnNC+0YHQutCy0LAxGTAXBgNVBAcMENCzLiDQnNC+0YHQutCy0LAxLjAs
                                BgNVBAkMJdGD0LvQuNGG0LAg0KLQstC10YDRgdC60LDRjywg0LTQvtC8IDcxLDAq
                                BgNVBAoMI9Cc0LjQvdC60L7QvNGB0LLRj9C30Ywg0KDQvtGB0YHQuNC4MRgwFgYF
                                KoUDZAESDTEwNDc3MDIwMjY3MDExGjAYBggqhQMDgQMBARIMMDA3NzEwNDc0Mzc1
                                MSwwKgYDVQQDDCPQnNC40L3QutC+0LzRgdCy0Y/Qt9GMINCg0L7RgdGB0LjQuIIK
                                ZVXrmgAAAAAARzAmBgNVHSUEHzAdBggrBgEFBQcDAgYIKwYBBQUHAwQGByqFAwIC
                                IgYwEwYDVR0gBAwwCjAIBgYqhQNkcQEwKwYDVR0QBCQwIoAPMjAxOTA2MTAxNDE1
                                MzRagQ8yMDIwMDYxMDE0MTUzNFowggEsBgUqhQNkcASCASEwggEdDCsi0JrRgNC4
                                0L/RgtC+0J/RgNC+IENTUCIgKNCy0LXRgNGB0LjRjyA0LjApDCwi0JrRgNC40L/R
                                gtC+0J/RgNC+INCj0KYiICjQstC10YDRgdC40Y8gMi4wKQxf0KHQtdGA0YLQuNGE
                                0LjQutCw0YIg0YHQvtC+0YLQstC10YLRgdGC0LLQuNGPINCk0KHQkSDQoNC+0YHR
                                gdC40Lgg0KHQpC8xMjQtMzM4MCDQvtGCIDExLjA1LjIwMTgMX9Ch0LXRgNGC0LjR
                                hNC40LrQsNGCINGB0L7QvtGC0LLQtdGC0YHRgtCy0LjRjyDQpNCh0JEg0KDQvtGB
                                0YHQuNC4INCh0KQvMTI4LTI5ODMg0L7RgiAxOC4xMS4yMDE2MCMGBSqFA2RvBBoM
                                GCLQmtGA0LjQv9GC0L7Qn9GA0L4gQ1NQIjCByAYDVR0fBIHAMIG9MC2gK6Aphido
                                dHRwOi8vY2EuaWFjLnNwYi5ydS9jcmwvaWFjX2dvc3QxMi5jcmwwLqAsoCqGKGh0
                                dHA6Ly80Ni4yNDMuMTc3LjExNC9jcmwvaWFjX2dvc3QxMi5jcmwwLKAqoCiGJmh0
                                dHA6Ly8xMC4xMjguMzEuNjUvY3JsL2lhY19nb3N0MTIuY3JsMC6gLKAqhihodHRw
                                Oi8vMTAuMTQ2LjE0MC4yNTEvY3JsL2lhY19nb3N0MTIuY3JsMIIBTQYIKwYBBQUH
                                AQEEggE/MIIBOzAvBggrBgEFBQcwAYYjaHR0cDovLzQ2LjI0My4xNzcuMTE0L29j
                                c3Avb2NzcC5zcmYwLwYIKwYBBQUHMAGGI2h0dHA6Ly8xMC4xNDYuMTQwLjI1MS9v
                                Y3NwL29jc3Auc3JmMDQGCCsGAQUFBzAChihodHRwOi8vY2EuaWFjLnNwYi5ydS9j
                                ZXJ0L2lhY19nb3N0MTIuY2VyMDUGCCsGAQUFBzAChilodHRwOi8vNDYuMjQzLjE3
                                Ny4xMTQvY2VydC9pYWNfZ29zdDEyLmNlcjAzBggrBgEFBQcwAoYnaHR0cDovLzEw
                                LjEyOC4zMS42NS9jZXJ0L2lhY19nb3N0MTIuY2VyMDUGCCsGAQUFBzAChilodHRw
                                Oi8vMTAuMTQ2LjE0MC4yNTEvY2VydC9pYWNfZ29zdDEyLmNlcjAKBggqhQMHAQED
                                AgNBAOt0Gu6A/A25QgSJH9xOt65gt/GrnPxYPD/SDkSEmBjpWbH6uTOJecCjeAFo
                                l2O3k57dJqx4/FcI8z7osl9D0Oc=
                            </ds:X509Certificate>
                        </ds:X509Data>
                    </ds:KeyInfo>
                </ds:Signature>
            </ns:CallerInformationSystemSignature>
        </ns:SendRequestRequest>
    </s:Body>
</s:Envelope>
